# Домашнее задание после третье главы. Рожков Артем
print('*')

# https://drive.google.com/open?id=15fBsTB1ZU_BzEw5SJmlOMX2uuyi1xN1-
#
# В файле содержится текст. Считать/скопировать текст из файла и выполнить следующую последовательность действий:
print('В файле содержится текст. Считать/скопировать текст из \nфайла и выполнить следующую последовательность действий:')

with open('123.txt', encoding='utf-8') as f:
    text = f.read()
print(text[0:150], '......ПЕРВЫЕ 150 СИМВОЛОВ')


print()
# 1) методами строк очистить текст от знаков препинания;
print('1) методами строк очистить текст от знаков препинания;')
my_str = text
symbols = ['.', ',', '-', '"', '"', '!', '?', ';', '-', '(', ')', ':']
for symbol in symbols:
    my_str = my_str.replace(symbol, '')

print(my_str [0:150], '<- ... ПЕРВЫЕ 150 СИМВОЛОВ без знаков приминания')


print()
# 2) сформировать list со словами (split);
print('   2) сформировать list со словами (split);')

my_str_list = my_str.split()
print(my_str_list[:150], '<- ... ПЕРВЫЕ 150 СИМВОЛОВ list')



print()
# 3) привести все слова к нижнему регистру (map);
print('   3) привести все слова к нижнему регистру (map);')

new_list = list(map(str.lower, my_str_list))
print(new_list[:150], '<- ... ПЕРВЫЕ 150 СИМВОЛОВ в нижнем регистре')




print()
# 3) получить из list пункта 3 dict, ключами которого являются слова, а значениями их количество появлений в тексте;
print('   3) получить из list пункта 3 dict, ключами которого являются слова,\n а значениями их количество появлений в тексте;')

my_dict = {}
for word in new_list:
    my_dict[word] = new_list.count(word)
print(my_dict)

print()
# II вариант
print('   II вариант')

my_dict = {word:new_list.count(word) for word in new_list}
print(my_dict)




print()
# 4) вывести 5 наиболее часто встречающихся слов (sort), вывести количество разных слов в тексте (set).
print('   4) вывести 5 наиболее часто встречающихся слов (sort), \n   вывести количество разных слов в тексте (set).')

