import random

# random() возвращает следующее случайное число с плавающей запятой в промежутке [0.0, 1.0].
print('Вывод случ числа при помощи random.random()')
print(random.random())  # вывели случ число

# Случ число в опред промежутке
print('      Случ число в опредю промежутке   ')

from random import randint
print('Вывод случайного целого числа:', randint(0, 105))
print('Вывод случайного целого числа №2 :', randint(0, 105))

print(' * ')
print('  Шаг показывает разницу между каждым числом заданной последовательности. Шаг по умолчанию равен 1, однако его значение можно изменить.')
from random import randrange
print('Вывод случайного целого числа', randrange(0,10,2)) # 3-е знач=шаг, он же кратность

# Случайный элемент из списка
print('      / / /  Случайный элемент из списка \ \ \  ')

name_list = ['Ваня', 'Зина', 'Артур', 'Илья', 'Семен', 'Просковья', 'Маргарита', 'Альберт', 'Фрэнк', 'Артем', 'Дмитрий']
print('Выбор случ-го имени из списка: ', random.choice(name_list))

# НЕсколько случайных элем-ов из списка
print('     -    НЕсколько случайных элем-ов из списка     -  ')
name_list = ['Ваня', 'Зина', 'Артур', 'Илья', 'Семен', 'Просковья', 'Маргарита', 'Альберт', 'Фрэнк', 'Артем', 'Дмитрий']
print('random.sample(): ', random.sample(name_list, 3))

print()